---
type: AnalysisDisplayColoredSurfaceSettings
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 10
tags: [revit-api, class]
---

# AnalysisDisplayColoredSurfaceSettings

`Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AnalysisDisplayColoredSurfaceSettings | — | `` |
| Constructor | AnalysisDisplayColoredSurfaceSettings | 2011 | `public AnalysisDisplayColoredSurfaceSettings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2011 | `public bool IsEqual ( AnalysisDisplayColoredSurfaceSettings other )` |
| Property | GridColor | 2011 | `public Color GridColor { get ; set ; }` |
| Property | GridLineWeight | 2011 | `public int GridLineWeight { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ShowContourLines | 2013 | `public bool ShowContourLines { get ; set ; }` |
| Property | ShowGridLines | 2011 | `public bool ShowGridLines { get ; set ; }` |
| Property | Transparency | 2019 | `public int Transparency { get ; set ; }` |